In [1]:
# Data types checks in ETL

In [2]:
import pandas as pd

In [4]:
src = pd.read_csv('E:/Python/MyPython/PycharmProjects/MyLearnings1/ETLQASession/TestFiles/11_empDT_SRC.csv')

In [5]:
src

   EmpNo  EmpName DeptName  Salary
0      1     Adam       IT  111.50
1      2    Peter       HR  222.00
2      3    Chris  Finance  333.75
3      4     Alan    Admin  444.00
4      5   Mayank       HR  222.00
5      6  Rajesh     Sales  555.55
6      7   Pankaj    Sales  555.00

In [6]:
tgt = pd.read_csv('E:/Python/MyPython/PycharmProjects/MyLearnings1/ETLQASession/TestFiles/11_empDT_TGT.csv')

In [7]:
tgt

   EmpNo  EmpName  DeptName  Salary
0      1     Adam       101  111.50
1      2    Peter       201  222.00
2      3    Chris       301  333.75
3      4     Alan       401  444.00
4      5   Mayank       201  222.00
5      6  Rajesh        501  555.55
6      7   Pankaj       501  555.00

In [15]:
# For loop to check data types of mismatched columns

for col in src.columns:
    if src[col].dtype != tgt[col].dtype:
       print("Data type mismatch for the column ", col, " between Source:", src[col].dtype, " and Target:", tgt[col].dtype)

Data type mismatch for the column  DeptName  between Source: object  and Target: int64

In [16]:
# For loop to check data types of matched columns

for col in src.columns:
    if src[col].dtype == tgt[col].dtype:
       print("Data type match for the column ", col, " between Source:", src[col].dtype, " and Target:", tgt[col].dtype)

Data type match for the column  EmpNo  between Source: int64  and Target: int64
Data type match for the column  EmpName  between Source: object  and Target: object
Data type match for the column  Salary  between Source: float64  and Target: float64